# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"

tap "argoproj/tap"
tap "homebrew/cask-fonts"
tap "getantibody/tap"
tap "k14s/tap"
tap "datawire/blackbird"
tap "srkomodo/tap"

# Binaries
brew "argoproj/tap/argocd"

brew "bat"
brew "coreutils"
brew "curl"
cask "osxfuse" # prereq for telepresence
brew "telepresence"
brew "dockutil"
brew "dive"
brew "dust"
brew "fd"
brew "findutils"
brew "fzf"
brew "getantibody/tap/antibody"
brew "git"
brew "gnupg"
brew "gnutls"
brew "go"
brew "grep"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kubectx"
brew "kustomize"
brew "lsd"
brew "mas"
brew "moreutils"
brew "nano"
brew "npm"
brew "openssl"
brew "pipx"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-which-ext"
brew "readline"
brew "ripgrep"
brew "screen"
brew "shadowfox-updater"
brew "starship"
brew "stern"
brew tap "tilt-dev/tap"
brew install tilt
brew "terraform"
brew "terminal-notifier"
brew "tree"
brew "wireguard-tools"
brew "wget"
brew "xz"
brew "yadm"
brew "yq"
brew "ytt"
brew "z"
brew "zsh"
brew "zsh-completions"

# Apps
cask "dashlane"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "gpg-suite"
cask "insomina"
cask "iterm2"
cask "karabiner-elements"
cask "kube-forwarder"
cask "logitech-options"
cask "macs-fan-control"
cask "ngrok"
cask "pgadmin4"
cask "pycharm"
cask "rectangle"
cask "ringcentral-meetings"
cask "slack"
cask "spotify"
cask "synergy"
cask "the-unarchiver"
cask "visual-studio-code"
cask "zoomus"

# aws
brew "awscli"
brew "aws-iam-authenticator"
cask "aws-vault"

# google
cask "google-cloud-sdk"


mas "Day One", id: 1055511498
mas "Bear", id: 1016366447
