# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"

tap "argoproj/tap"
tap "caskroom/fonts"
tap "getantibody/tap"
tap "getantibody/tap"

# Binaries
brew "argoproj/tap/argocd"
brew "coreutils"
brew "curl"
cask "osxfuse" # prereq for telepresence
brew "datawire/blackbird/telepresence"
brew "dockutil"
brew "findutils"
brew "getantibody/tap/antibody"
brew "git"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "htop"
brew "httpie"
brew "jq"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "kustomize"
brew "mas"
brew "moreutils"
brew "nano"
brew "npm"
brew "openssl"
brew "pre-commit"
brew "pyenv"
brew "pyenv-doctor"
brew "pyenv-update"
brew "pyenv-virtualenv"
brew "pyenv-which-ext"
brew "readline"
brew "screen"
brew "srkomodo/tap/shadowfox-updater"
brew "stern"
brew "terminal-notifier"
brew "tree"
brew "wget"
brew "xz"
brew "yadm"
brew "yq"
brew "z"
brew "zsh"
brew "zsh-completions"

# Apps
cask "dashlane"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "font-firacode-nerd-font"
cask "google-cloud-sdk"
cask "iterm2"
cask "karabiner-elements"
cask "kube-forwarder"
cask "logitech-options"
cask "pgadmin4"
cask "ringcentral-meetings"
cask "slack"
cask "smcfancontrol"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
