tap "aquasecurity/trivy"
tap "argoproj/tap"
tap "arkweid/lefthook"
tap "codefresh-io/cli"
tap "dagger/tap"
tap "datawire/blackbird"
tap "derailed/popeye"
tap "equinix-labs/otel-cli"
tap "fairwindsops/tap"
tap "getantibody/tap"
tap "go-task/tap"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homeport/tap"
tap "jgavris/rs-git-fsmonitor", "https://github.com/jgavris/rs-git-fsmonitor.git"
tap "k14s/tap"
tap "kreuzwerker/taps"
tap "owenthereal/upterm"
tap "srkomodo/tap"
tap "txn2/tap"
brew "act"
brew "angle-grinder"
brew "git"
brew "antibody"
brew "argo"
brew "argocd"
brew "xz"
brew "asciinema"
brew "aws-iam-authenticator"
brew "awscli"
brew "bandwhich"
brew "bat"
brew "broot"
brew "glib"
brew "python@3.9"
brew "copier"
brew "coreutils"
brew "openldap"
brew "curl"
brew "devspace", link: false
brew "difftastic"
brew "direnv"
brew "dive"
brew "dockutil", link: false
brew "dust"
brew "fd"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "gobject-introspection"
brew "libass"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fx"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "goenv", args: ["HEAD"]
brew "gource"
brew "grep"
brew "hadolint"
brew "helm"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "iam-policy-json-to-terraform"
brew "iproute2mac"
brew "jless"
brew "jq"
brew "k3d"
brew "k9s"
brew "krb5"
brew "krew"
brew "kubectx"
brew "kubernetes-cli@1.22"
brew "kubespy"
brew "kustomize"
brew "kyverno"
brew "linkerd"
brew "lolcat"
brew "lsd"
brew "lsusb"
brew "mas"
brew "moreutils"
brew "nano"
brew "netcat"
brew "nghttp2"
brew "node"
brew "nvm"
brew "pipx"
brew "postgresql@14"
brew "prettier"
brew "procs"
brew "tcl-tk"
brew "python@3.8"
brew "redis"
brew "ripgrep"
brew "screen"
brew "shellcheck"
brew "starship"
brew "step"
brew "stern"
brew "telnet"
brew "terminal-notifier"
brew "terraform", link: false
brew "terrascan"
brew "tfenv"
brew "tokei"
brew "tree"
brew "upx"
brew "watchman"
brew "wget"
brew "wireguard-tools"
brew "yadm", link: false
brew "yq"
brew "z"
brew "zenith"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "aquasecurity/trivy/trivy"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "arkweid/lefthook/lefthook"
brew "codefresh-io/cli/codefresh"
brew "dagger/tap/dagger"
brew "derailed/popeye/popeye"
brew "equinix-labs/otel-cli/otel-cli"
brew "go-task/tap/go-task"
brew "homeport/tap/dyff"
brew "jgavris/rs-git-fsmonitor/rs-git-fsmonitor"
brew "k14s/tap/ytt"
brew "kreuzwerker/taps/envplate"
brew "owenthereal/upterm/upterm"
brew "srkomodo/tap/shadowfox-updater"
brew "txn2/tap/kubefwd"
cask "alacritty"
cask "amethyst"
cask "aws-vault"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "gitup"
cask "iterm2"
cask "karabiner-elements"
cask "keybase"
cask "kube-forwarder"
cask "kui"
cask "lens"
cask "logitech-options"
cask "osxfuse"
cask "pgadmin4"
cask "pycharm"
cask "rectangle"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"
