zdharma/fast-syntax-highlighting
zsh-users/zsh-autosuggestions
#zsh-users/zsh-syntax-highlighting
zsh-users/zsh-history-substring-search
#marlonrichert/zsh-autocomplete # https://github.com/marlonrichert/zsh-autocomplete/issues/95

# THEME
romkatv/powerlevel10k
joel-porquet/zsh-dircolors-solarized
chrissicool/zsh-256color
zlsun/solarized-man

#denysdovhan/spaceship-prompt

# COMPLETIONS
zsh-users/zsh-completions
srijanshetty/zsh-pip-completion
black7375/zsh-lazyenv

